Revit 2024 API
ConnectionInputPoint.Id Property
 Unique id of this input point.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public Guid Id { get; set; }
Visual Basic
Public Property Id As Guid
	Get
	Set
Visual C++
public:
property Guid Id {
	Guid get ();
	void set (Guid value);
}
See Also
ConnectionInputPoint Class
Autodesk.Revit.DB.Structure Namespace